src/cf/ExchangePlans/ИнтеграцияСМагазинамиСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>ИнтеграцияСМагазинамиСоцСетей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МагазинДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МагазиныСоцСетейДляИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкончанияДействияТокенаДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьИзмененияНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатурыСтарая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиДатыДляМагазинаСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказаКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоФотографийДляКарточки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыгрузкиХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыгрузкиХарактеристикДляМагазинаСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНабораВариантов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтрокаАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьФайлыХарактеристикиИзНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбмениватьсяСтатусамиЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтрокаАвторизацииСообщества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТокенДоступаСообщества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкончанияДействияТокенДоступаСообщества</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОтборПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПодборкиТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключитьВходящиеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСкрытуюКопиюВПоддержку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентныеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРегламентногоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервироватьТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьКНаименованиюХарактеристикиНаименованиеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Comment>0 - oauth, 1 - VK ID</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатуса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтатуса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗаказаПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СлужбыДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособДоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужбаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СлужбыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СостояниеНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСтраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаСобытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлектроннаяПочта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Капча</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/cf/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПунктВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Курьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/МагазиныСоцСетейДляИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МагазиныСоцСетейДляИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>VK</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/ExchangePlans/ИнтеграцияСМагазинамиСоцСетей/Forms/ФормаУзлаВКонтакте/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// служебный вызов для удаления устаревших записей в логе
    ОбменСВнешнимиСистемамиЛогирование.ЛогЗаписиСтарыеПоВсемУчетнымЗаписямОчиститьЧерезФоновоеЗадание();
	
	РазделениеВключено = РаботаВМоделиСервиса.РазделениеВключено();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВалютаДляПодстановкиВЗаказы = Константы.ВалютаУчета.Получить();
		Объект.СпособАвторизации = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииVKID();
	КонецЕсли;
	
	НастроитьРасписаниеРегламентногоЗадания = ПолучитьРасписаниеРегламентногоЗадания();
	
	ОбновитьДанныеНаСервере();
	ОбновитьОтображениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.НастройкаЗавершена Тогда
		ДобавитьНастройкуНаКлиенте( "Интеграции", 2 );
		ДобавитьНастройкуНаКлиенте( "Обслуживание", 2 );
	Иначе
		ДобавитьНастройкуНаКлиенте( "Интеграции", 0 );
		ДобавитьНастройкуНаКлиенте( "Обслуживание", 0 );
	КонецЕсли;
	
	ОбновитьОтображениеНаКлиенте();
	
	Если Объект.НастройкаЗавершена Тогда
		ПоказатьСтраницуИнтеграции();
	КонецЕсли;

	ОбновитьНаФормеПризнакОшибкиАвторизации();
	
	ПодключитьОбработчикОжидания("ОбновитьОтображениеВремениЗапускаНаКлиенте", 15);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "НеКорректныйВводКапчи" Тогда
		ЗапуститьОперациюВФонеЗавершение("Капча",Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СтрШаблон = "Интеграция (%1)";
	Объект.Наименование = СтрШаблон(СтрШаблон, Объект.НаименованиеГруппы);
	
	Если Не ЗначениеЗаполнено(Объект.Код) Тогда
		УстановитьНовыйКодНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияТекстПодсказки14ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗагрузитьТоварыВКонтактеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТекстПодсказки14Нажатие(Элемент)
	ЗагрузитьТоварыВКонтактеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СписокСкладовПриИзменении(Элемент)
	
	Объект.СтруктурныеЕдиницы.Очистить();
	Для Каждого Стр Из СписокСкладов Цикл
		Если ЗначениеЗаполнено(Стр.Значение) Тогда
			НовСтр = Объект.СтруктурныеЕдиницы.Добавить();
			НовСтр.СтруктурнаяЕдиница = Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСкладовОчистка(Элемент, СтандартнаяОбработка)
	Объект.СтруктурныеЕдиницы.Очистить();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентныеЗаданияПриИзменении(Элемент)

	Записать();

	СсылкаНаУзелОбмена = Объект.Ссылка;
	
	Если Объект.ИспользоватьРегламентныеЗадания = Истина Тогда
		СоздатьРегламентноеЗаданиеОбмена( СсылкаНаУзелОбмена );
	Иначе
		УдалитьРегламентноеЗаданиеОбмена( СсылкаНаУзелОбмена );
	КонецЕсли;

	Прочитать();	
КонецПроцедуры

&НаКлиенте
Процедура КодПриложенияПриИзменении(Элемент)
	АвторизацияВКонтактеПараметры.access_token = "";
	АвторизацияВКонтактеПараметры.ОкончанияДействияТокенаДоступа = Дата( 1, 1, 1 );
КонецПроцедуры

&НаКлиенте
Процедура ФормаОпубликоватьПодменюНажатие(Элемент)
	
	Список = Новый СписокЗначений;
	Список.Добавить("УдалитьИнтеграцию", НСтр("ru='Удалить интеграцию'"), Ложь, БиблиотекаКартинок.СерыйКрест);
	Список.Добавить("ЗарегистрироватьВсеДанныеКОбмену", НСтр("ru='Зарегистрировать все данные к обмену'"), Ложь);
	Список.Добавить("ЗарегистрироватьЦенуИКоличествоКОбмену", НСтр("ru='Зарегистрировать цену и количество к обмену'"), Ложь);
	Список.Добавить("ОткрытьПоследнююУспешнуюЗапись", НСтр("ru='Открыть последнюю успешную запись'"), Ложь);
	Список.Добавить("УдалитьЗарегистрированныеИзменения", НСтр("ru='Удалить зарегистрированные изменения'"), Ложь);
	Оповещение = Новый ОписаниеОповещения("ФормаОпубликоватьПослеВыбораПодменю", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, Список, Элементы.ФормаОпубликоватьПодменю);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьВозможностьНажатие(Элемент)
	
	ТекстДляПисьма = НСтр("ru = 'Опишите, каких возможностей вам не хватает для приложения ""Магазин ВКонтакте"":'");
	Тег = НСтр("ru = 'Магазин ВКонтакте'");
	
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, ТекстДляПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыполнитьНастройкуРасписания(ПолучитьРасписаниеРегламентногоЗадания());
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтеграцииКартинкаНажатие(Элемент)
	ПоказатьСтраницуИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ИнтеграцииНадписьНажатие(Элемент)
	ПоказатьСтраницуИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаСопоставленияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ФормаВыбораНоменклатурыЗавершение", ЭтотОбъект );
	
	ОписаниеУзлаОбменаВК = Новый Структура;
	ОписаниеУзлаОбменаВК.Вставить("ИдентификаторГруппы" , Объект.ИдентификаторГруппы);
	ОписаниеУзлаОбменаВК.Вставить("МагазинДляИнтеграции" , Объект.МагазинДляИнтеграции);
	ОписаниеУзлаОбменаВК.Вставить("СсылкаНаУзелОбмена" , Объект.Ссылка);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаВыбораНоменклатуры", ОписаниеУзлаОбменаВК, 
	ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторГруппыПриИзменении(Элемент)
	Объект.НаименованиеГруппы =
	Элементы.ИдентификаторГруппы.СписокВыбора.НайтиПоЗначению(Объект.ИдентификаторГруппы).Представление;
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьОстатокПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьЦеныПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СпособУстановкиДатыОтгрузкиЗаказаПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбмениватьсяСтатусамиЗаказаПриИзменении(Элемент)
	
	ОбновитьОтображениеНаКлиенте();
	
	Если Объект.ОбмениватьсяСтатусамиЗаказа Тогда
		
		НовСтр = Объект.СтатусыЗаказов.Добавить();
		НовСтр.КодСтатуса = 0;
		НовСтр.НаименованиеСтатуса = "Новый";
		
		НовСтр = Объект.СтатусыЗаказов.Добавить();
		НовСтр.КодСтатуса = 1;
		НовСтр.НаименованиеСтатуса = "Согласуется";
		
		НовСтр = Объект.СтатусыЗаказов.Добавить();
		НовСтр.КодСтатуса = 2;
		НовСтр.НаименованиеСтатуса = "Собирается";
		
		НовСтр = Объект.СтатусыЗаказов.Добавить();
		НовСтр.КодСтатуса = 3;
		НовСтр.НаименованиеСтатуса = "Доставляется";
		
		НовСтр = Объект.СтатусыЗаказов.Добавить();
		НовСтр.КодСтатуса = 6;
		НовСтр.НаименованиеСтатуса = "Возвращен";
		
	Иначе
		Объект.СтатусыЗаказов.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДоставкуПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
	
	Если Объект.ИспользоватьДоставку Тогда
		// Идентификаторы доставки
		НовСтр = Объект.СлужбыДоставки.Добавить();
		НовСтр.Идентификатор = "В ближайшее почтовое отделение";
		НовСтр.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Почта");
		
		НовСтр = Объект.СлужбыДоставки.Добавить();
		НовСтр.Идентификатор = "Курьерская доставка";
		НовСтр.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Курьер");
		
		НовСтр = Объект.СлужбыДоставки.Добавить();
		НовСтр.Идентификатор = "Самовывоз";
		НовСтр.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз");
		НовСтр.СлужбаДоставки = ПредопределенноеЗначение("Справочник.СлужбыДоставки.ДоставкаСобственнымиСилами");
		
		НовСтр = Объект.СлужбыДоставки.Добавить();
		НовСтр.Идентификатор = "Доставка в пункт выдачи СДЭК";
		НовСтр.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ПунктВыдачи");
		
		НовСтр = Объект.СлужбыДоставки.Добавить();
		НовСтр.Идентификатор = "Доставка в пункт выдачи Boxberry";
		НовСтр.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ПунктВыдачи");
	Иначе
		Объект.СлужбыДоставки.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыгрузкиХарактеристикПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПроверкиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаПроверкиИзображенийТоваров",,
	ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПодборкиТоваровПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКартинкаНажатие(Элемент)
	ПоказатьСтраницуТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНадписьНажатие(Элемент)
	ПоказатьСтраницуТовары();
КонецПроцедуры

&НаКлиенте
Процедура ОбслуживаниеКартинкаНажатие(Элемент)
	ПоказатьСтраницуОбслуживание();
КонецПроцедуры

&НаКлиенте
Процедура ОбслуживаниеНадписьНажатие(Элемент)
	ПоказатьСтраницуОбслуживание();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКартинкаНажатие(Элемент)
	ПоказатьСтраницуЗаказы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНадписьНажатие(Элемент)
	ПоказатьСтраницуЗаказы();
КонецПроцедуры

&НаКлиенте
Процедура СтатусыЗаказаКартинкаНажатие(Элемент)
	ПоказатьСтраницуСтатусыЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура СтатусыЗаказаНадписьНажатие(Элемент)
	ПоказатьСтраницуСтатусыЗаказа();
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаКартинкаНажатие(Элемент)
	ПоказатьСтраницуДоставка();
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаНадписьНажатие(Элемент)
	ПоказатьСтраницуДоставка();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноНадписьНажатие(Элемент)
	ПоказатьСтраницуДополнительно();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноКартинкаНажатие(Элемент)
	ПоказатьСтраницуДополнительно();
КонецПроцедуры

&НаКлиенте
Процедура ЧатКартинкаНажатие(Элемент)
	ПоказатьСтраницуЧат();
КонецПроцедуры

&НаКлиенте
Процедура ЧатНадписьНажатие(Элемент)
	ПоказатьСтраницуЧат();
КонецПроцедуры 

&НаКлиенте
Процедура ПриветствиеКартинкаНажатие(Элемент)
	ПоказатьСтраницуПриветствие();
КонецПроцедуры

&НаКлиенте
Процедура ПриветствиеНадписьНажатие(Элемент)
	ПоказатьСтраницуПриветствие();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТоваровНадписьНажатие(Элемент)
	ЗагрузитьТоварыВКонтактеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТоваровКартинкаНажатие(Элемент)
	ЗагрузитьТоварыВКонтактеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПомощьКартинкаНажатие(Элемент)
	
	ОткрытьИнструкцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощьНадписьНажатие(Элемент)
	
	ОткрытьИнструкцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьВходящиеСообщенияПриИзменении(Элемент)
	ВкладкаЧатОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОповещениеПриИзменении(Элемент)
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияКартинкаНажатие(Элемент)
	ПоказатьСтраницуОповещение();
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияНадписьНажатие(Элемент)
	ПоказатьСтраницуОповещение();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТекстПодсказки11ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "КакСоздатьПриложениеВКонтакте" Тогда
		ОбщегоНазначенияКлиент.ОткрытьНавигационнуюСсылку( "https://its.1c.ru/db/metod81#content:7805:hdoc" );
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДекорацияТекстПодсказки10ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЧатВКонтакте" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок" , "Чат сообщества ВКонтакте в 1С");
		ПараметрыФормы.Вставить("ИмяМакета" , "ПодсказкаЧат");
		
		ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаПодсказки",ПараметрыФормы,
		ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры 


&НаКлиенте
Процедура СтрокаПроверкиНажатие2(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаПроверкиИзображенийТоваров",,
	ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТекстПодсказки14Нажатие2(Элемент)
	ЗагрузитьТоварыВКонтактеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТекстПодсказки14ОбработкаНавигационнойСсылки2(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗагрузитьТоварыВКонтактеНаКлиенте();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыЗаказов

&НаКлиенте
Процедура СтатусыЗаказовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыЗаказовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодпискиНаСобытие

&НаКлиенте
Процедура ПодпискиНаСобытиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда 
		ТекущиеДанные = Элементы.ПодпискиНаСобытие.ТекущиеДанные;
		ТекущиеДанные.Капча = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьИнтеграциюНаКлиенте(Команда)
	УдалитьИнтеграцию();
КонецПроцедуры

&НаКлиенте
Процедура НачатьНастройку(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",1);
	Элементы.КнопкаНачатьНастройку.КнопкаПоУмолчанию = Ложь;
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад4(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",1);
	ДобавитьНастройкуНаКлиенте("Товары",0);
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее4(Команда)
	
	Если Объект.ВыгружатьЦены И Не ЗначениеЗаполнено(Объект.ВидЦеныНоменклатуры) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите основную цену!",,"ВидЦеныНоменклатуры","Объект");
		Возврат;
	КонецЕсли;
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",1);
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад5(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",1);
	ДобавитьНастройкуНаКлиенте("Заказы",0);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее5(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",2);
	ДобавитьНастройкуНаКлиенте("СтатусыЗаказа",1);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад6(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",1);
	ДобавитьНастройкуНаКлиенте("СтатусыЗаказа",0);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее6(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",2);
	ДобавитьНастройкуНаКлиенте("СтатусыЗаказа",2);
	ДобавитьНастройкуНаКлиенте("Доставка",1);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад7(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",2);
	ДобавитьНастройкуНаКлиенте("СтатусыЗаказа",1);
	ДобавитьНастройкуНаКлиенте("Доставка",0);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее7(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",2);
	ДобавитьНастройкуНаКлиенте("СтатусыЗаказа",2);
	ДобавитьНастройкуНаКлиенте("Доставка",2);
	ДобавитьНастройкуНаКлиенте("Оповещения",1);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад8(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",2);
	ДобавитьНастройкуНаКлиенте("СтатусыЗаказа",2);
	ДобавитьНастройкуНаКлиенте("Доставка",1);
	ДобавитьНастройкуНаКлиенте("Оповещения",0);
	ДобавитьНастройкуНаКлиенте("Интеграции",0);
	ДобавитьНастройкуНаКлиенте("Обслуживание",0);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее8(Команда)
	
	Если Объект.ИспользоватьОповещения И Не ЗначениеЗаполнено(Объект.УчетнаяЗаписьДляОповещения) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите учетную запись для отправки писем!",,"УчетнаяЗаписьДляОповещения","Объект");
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ИспользоватьОповещения И ЗначениеЗаполнено(Объект.УчетнаяЗаписьДляОповещения) 
		И НЕ УчетнаяЗаписьНастроена(Объект.УчетнаяЗаписьДляОповещения) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Требуется настроить учетную запись для отправки писем!",,"УчетнаяЗаписьДляОповещения","Объект"); 
		
		ПоказатьЗначение(,Объект.УчетнаяЗаписьДляОповещения);
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ИспользоватьОповещения И Объект.ПодпискиНаСобытие.Количество() = 0  Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите минимум 1 получателя!",,"ПодпискиНаСобытие","Объект"); 
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ИспользоватьОповещения И Объект.ПодпискиНаСобытие.Количество() > 0 Тогда
		
		ПроверкаНеПройдена = Ложь;
		Для Каждого Стр Из Объект.ПодпискиНаСобытие Цикл
			Если Не ЭтоКорректныйEmail(Стр.ЭлектроннаяПочта) Тогда
				//@skip-check bsl-legacy-check-dynamic-feature-access
				ОбщегоНазначенияКлиент.СообщитьПользователю("Не корректный Email!",,
				"ПодпискиНаСобытие[" +( Стр.НомерСтроки - 1) + "].ЭлектроннаяПочта","Объект");
				ПроверкаНеПройдена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПроверкаНеПройдена Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",2);
	ДобавитьНастройкуНаКлиенте("Заказы",2);
	ДобавитьНастройкуНаКлиенте("СтатусыЗаказа",2);
	ДобавитьНастройкуНаКлиенте("Доставка",2);
	ДобавитьНастройкуНаКлиенте("Оповещения",2);
	ДобавитьНастройкуНаКлиенте("Интеграции",2);
	ДобавитьНастройкуНаКлиенте("Обслуживание",2);
	ОбновитьОтображениеНаКлиенте();
	ПоказатьСтраницуИнтеграции();
КонецПроцедуры 

&НаКлиенте
Процедура КнопкаНазад2(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",1);
	ДобавитьНастройкуНаКлиенте("Дополнительно",0);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее2(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодПриложения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните поле ""ID приложения""",,"КодПриложения","Объект");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АвторизацияВКонтактеПараметры.access_token) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("""Токен доступа"" не заполнен");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторГруппы) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните поле ""Сообщество ВКонтакте""",,"ИдентификаторГруппы","Объект");
		Возврат;
	КонецЕсли;
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",1);
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНазад3(Команда)
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",1);
	ДобавитьНастройкуНаКлиенте("Чат",0);
	ОбновитьОтображениеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДалее3(Команда)
	
	Если Объект.ПодключитьВходящиеСообщения Тогда
		
		Если ОбсужденияПодключены() Тогда
			ОбсужденияПодключеныЗавершение(Истина, Неопределено);
			
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбсужденияПодключеныЗавершение",ЭтотОбъект);
			ОбсужденияКлиент.ПоказатьПодключение(ОписаниеОповещения);
		КонецЕсли;
		
	Иначе 
		
		ОбсужденияПодключеныЗавершение(Истина, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборкуТоваров(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторГруппы" , Объект.ИдентификаторГруппы);
	ПараметрыФормы.Вставить("МагазинДляИнтеграции" , Объект.МагазинДляИнтеграции);
	ПараметрыФормы.Вставить("СсылкаНаУзелОбмена" , Объект.Ссылка);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаНаполненияВиртуальныхКаталогов",ПараметрыФормы,
	ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбменТолькоИзменения(Команда)
	ЗапуститьОперациюВФоне();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТокенДоступаСообщества(Команда)
	ФормаАвторизацииВКонтактеОткрыть( Истина );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЛогОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "РегистрСведений.ОбменСВнешнимиСистемамиЛогирование.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДополнительныеПоляФайловДляМагазинаСоцСетейОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "РегистрСведений.ДополнительныеПоляФайловДляМагазинаСоцСетей.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗначениеДополнительныхПолейОбъектовДляМагазинаСоцСетейОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "РегистрСведений.ЗначениеДополнительныхПолейОбъектовДляМагазинаСоцСетей.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВиртуальныеКаталогиТоваровМагазиновСоцСетейПрисоединенныеФайлыОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "Справочник.ВиртуальныеКаталогиТоваровМагазиновСоцСетейПрисоединенныеФайлы.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСопоставлениеИдентификаторовМагазиновСоцСетейОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "РегистрСведений.СопоставлениеИдентификаторовМагазиновСоцСетей.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСопоставлениеФайловДляМагазинаСоцСетейОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "РегистрСведений.СопоставлениеФайловДляМагазинаСоцСетей.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВиртуальныеКаталогиТоваровМагазиновСоцСетейОткрыть(Команда)
  	ПараметрыФормы = Новый Структура( "УчетнаяЗапись", Объект.Ссылка );
	ОткрытьФорму( "Справочник.ВиртуальныеКаталогиТоваровМагазиновСоцСетей.ФормаСписка", ПараметрыФормы );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРегистрацияИзмененийОткрыть(Команда)

	УзелОбмена = Объект.Ссылка;
	
	ПараметрыФормы = Новый Структура("УзелОбмена", УзелОбмена);
	
	ОткрытьФорму("Обработка.РегистрацияИзмененийДляОбменаДанными.Форма.Форма",
	ПараметрыФормы,	ЭтотОбъект );
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокГрупп(Команда)
	ОбновитьСписокГруппНаСервере( Истина );
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьВсеДанныеКОбмену(Команда)
	//@skip-check invocation-form-event-handler
	ЗарегистрироватьВсеДанныеКОбменуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьЦенуИКоличествоКОбмену(Команда)
	//@skip-check invocation-form-event-handler
	ЗарегистрироватьЦенуИКоличествоКОбменуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьЦенуИКоличествоКОбменуНаКлиенте()
	ЗарегистрироватьВсеДанныеКОбменуНаСервере(Объект.Ссылка, Истина);
	ОбщегоНазначенияКлиент.СообщитьПользователю( "Цены и количество товаров магазина успешно зарегистрированы к обмену." );
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьВсеДанныеКОбменуНаКлиенте()
	ЗарегистрироватьВсеДанныеКОбменуНаСервере(Объект.Ссылка);
	ОбщегоНазначенияКлиент.СообщитьПользователю( "Все данные магазина успешно зарегистрированы к обмену." );
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйМагазин(Команда)
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаУзлаВКонтакте",,
	ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТокенДоступа(Команда)
	ФормаАвторизацииВКонтактеОткрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЭтоКорректныйEmail(ЭлектроннаяПочта)
	Возврат ИнтеграцияСМагазинамиСоцСетейСервер.ЭтоКорректныйEmail(ЭлектроннаяПочта);
КонецФункции

&НаКлиенте
Процедура ВыполнитьНастройкуРасписания(РасписаниеЗадания, ЭтоПолныйОбмен = Ложь)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеЗадания);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Расписание", РасписаниеЗадания);
	ДополнительныеПараметры.Вставить("ЭтоПолныйОбмен", ЭтоПолныйОбмен);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьНастройкуРасписанияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		
		ВыполнитьНастройкуРасписанияЗавершениеНаСервере(ДополнительныеПараметры.Расписание, ДополнительныеПараметры.ЭтоПолныйОбмен);
		
		НастроитьРасписаниеРегламентногоЗадания = ДополнительныеПараметры.Расписание;
		
	Иначе
		ВыполнитьНастройкуРасписанияЗавершениеНаСервере(Расписание, ДополнительныеПараметры.ЭтоПолныйОбмен);
		
		НастроитьРасписаниеРегламентногоЗадания = Расписание;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНастройкуРасписанияЗавершениеНаСервере(Расписание, ЭтоПолныйОбмен = Ложь)
	
	Если РазделениеВключено И Расписание.ПериодПовтораВТечениеДня < 300 Тогда
		Расписание.ПериодПовтораВТечениеДня = 300;
		ОбщегоНазначения.СообщитьПользователю("Минимальное время запуска фонового задания 5 минут.");
	КонецЕсли;
	
	Объект.РасписаниеРегламентногоЗадания = ЗначениеВСтрокуВнутр(Расписание);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОперациюВФонеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "Капча" Тогда
	КонецЕсли;
	
	Прочитать();
	
	ОбновитьДанныеНаСервере();
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		СтрокаЗначениеСКартинки = Результат;
		
		ЗапуститьОперациюВФоне(Истина);
		
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегистрироватьВсеДанныеКОбменуНаСервере(УзелИнформационнойБазы, ТолькоЦенаИКоличество = Ложь)
	ИнтеграцияСМагазинамиСоцСетейСервер.ЗарегистрироватьВсеДанныеКОбменуНаСервере(УзелИнформационнойБазы, ТолькоЦенаИКоличество);
КонецПроцедуры

&НаКлиенте
Процедура УдалениеТоваровВК()
	ОткрытьФорму("РегистрСведений.ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоследнююУспешнуюЗапись()
	ОткрытьФорму("РегистрСведений.ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.ФормаСписка", , ЭтотОбъект);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьРегламентноеЗаданиеОбмена( СсылкаНаУзелОбмена )
	ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.СоздатьРегламентноеЗаданиеОбмена( СсылкаНаУзелОбмена );
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьРегламентноеЗаданиеОбмена( СсылкаНаУзелОбмена )
	ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.УдалитьРегламентноеЗаданиеОбмена( СсылкаНаУзелОбмена );
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаФормеПризнакОшибкиАвторизации()
	
	Элементы.ГруппаПризнакОшибкаАвторизации.Видимость = ОшибкаАвторизации;
	
	Если ОшибкаАвторизации = Истина Тогда
		ПоказатьСтраницуДополнительно();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокГруппНаСервере( ПоказатьДополнительныеСообщения = Ложь )
	
	Элементы.ИдентификаторГруппы.СписокВыбора.Очистить();
	
	Если Объект.Ссылка.Пустая() Тогда
	
		ОписаниеУзлаОбменаВК = Новый Структура;
		ОписаниеУзлаОбменаВК.Вставить("ТокенДоступа", АвторизацияВКонтактеПараметры.access_token);
		
	Иначе
	
		ОписаниеУзлаОбменаВК = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьОписаниеУзлаОбмена( Объект.Ссылка );
		
		// заполним токен из формы, так как могли поменять на форме и ещё не записать в базу
		ОписаниеУзлаОбменаВК.ТокенДоступа = АвторизацияВКонтактеПараметры.access_token; 
		ОписаниеУзлаОбменаВК.ОкончанияДействияТокенаДоступа = АвторизацияВКонтактеПараметры.ОкончанияДействияТокенаДоступа;
		
	КонецЕсли;
	
	ОшибкаАвторизации = Ложь;
	
	ОшибкаТекст = "";
	СообществаВКонтактеНаСайте = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьСписокГруппПользователя(ОписаниеУзлаОбменаВК, ОшибкаТекст);

	Если Не ПустаяСтрока( ОшибкаТекст ) Тогда
		Если СтрНайти( ОшибкаТекст, "User authorization failed: invalid access_token" ) > 0 Тогда
			ОшибкаАвторизации = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипЗнч( СообществаВКонтактеНаСайте ) <> Тип( "СписокЗначений" ) Тогда
		СообщениеТекст = НСтр( "ru = 'Не удалось получить сообщества сайта ВКонтакте.'" );
		ОбщегоНазначения.СообщитьПользователю( СообщениеТекст );
		Возврат;
	КонецЕсли;

	Если СообществаВКонтактеНаСайте.Количество() = 0 Тогда
		СообщениеТекст = НСтр( "ru = 'Не удалось получить сообщества сайта ВКонтакте.'" );
		ОбщегоНазначения.СообщитьПользователю( СообщениеТекст );
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнтеграцияСМагазинамиСоцСетей.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ИнтеграцияСМагазинамиСоцСетей.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ИнтеграцияСМагазинамиСоцСетей КАК ИнтеграцияСМагазинамиСоцСетей
	|ГДЕ
	|	ИнтеграцияСМагазинамиСоцСетей.МагазинДляИнтеграции = ЗНАЧЕНИЕ(Перечисление.МагазиныСоцСетейДляИнтеграции.VK)
	|	И НЕ ИнтеграцияСМагазинамиСоцСетей.ПометкаУдаления
	|	И ИнтеграцияСМагазинамиСоцСетей.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	СообществаДругихИнтеграций = РезультатЗапроса.Выгрузить();
	
	ФормаСписокВыбора = Элементы.ИдентификаторГруппы.СписокВыбора;
	Для Каждого СообществаВКонтактеНаСайтеЭлемент Из СообществаВКонтактеНаСайте Цикл
		
		СообществаДругихИнтеграцийСтрока = СообществаДругихИнтеграций.Найти( СообществаВКонтактеНаСайтеЭлемент.Значение, "ИдентификаторГруппы" );
		Если СообществаДругихИнтеграцийСтрока = Неопределено Тогда
		
			ФормаСписокВыбора.Добавить( СообществаВКонтактеНаСайтеЭлемент.Значение, СообществаВКонтактеНаСайтеЭлемент.Представление, 
			СообществаВКонтактеНаСайтеЭлемент.Значение = Объект.ИдентификаторГруппы);
			
		Иначе
			Если ПоказатьДополнительныеСообщения = Истина 
			И Элементы.ИдентификаторГруппы.ТолькоПросмотр = Ложь
			Тогда
				СообщениеШаблон = НСтр( "ru = 'Сообщество ВКонтакте ""%1"" исключено из списка для выбора. Используется в настройке интеграции ""%2"".'" );
				СообщениеТекст = СтрШаблон( СообщениеШаблон, СообществаВКонтактеНаСайтеЭлемент.Представление, СообществаДругихИнтеграцийСтрока.Ссылка );
				ОбщегоНазначения.СообщитьПользователю( СообщениеТекст );
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ФормаСписокВыбора.СортироватьПоПредставлению();
	
	Если ФормаСписокВыбора.Количество() = 1 Тогда
		Объект.ИдентификаторГруппы = ФормаСписокВыбора[ 0 ].Значение;
		Объект.НаименованиеГруппы = ФормаСписокВыбора[ 0 ].Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеВремениЗапускаНаКлиенте() Экспорт
	
	Если Объект.НастройкаЗавершена Тогда
		ОбновитьОтображениеВремениЗапуска();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеВремениЗапуска()
	
	СтрокаВремени = "--:--";
	СтрокаВремени2 = "--:--";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.ДатаОперации), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОперации
		|ИЗ
		|	РегистрСведений.ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей КАК ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей
		|ГДЕ
		|	ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Элементы.СтраницыВариантаПоздравления.ТекущаяСтраница = Элементы.СтраницаПоздравлениеПочтиВсе;
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОперации) Тогда
		СтрокаВремени = Формат(ВыборкаДетальныеЗаписи.ДатаОперации, "ДФ=HH:mm");
		СтрокаВремени2 = Формат(ВыборкаДетальныеЗаписи.ДатаОперации + 300, "ДФ=HH:mm") + " -" + Формат(ВыборкаДетальныеЗаписи.ДатаОперации + 900, "ДФ=HH:mm");
		Элементы.ВыполнитьОбменТолькоИзменения.Заголовок = НСтр("ru = 'Выполнить обмен вручную'"); 
		Элементы.СтраницыВариантаПоздравления.ТекущаяСтраница = Элементы.СтраницаПоздравление;
		Элементы.СтраницыГруппаПодсказкаАссистентаПервичныйЗапуск.ТекущаяСтраница = Элементы.СтраницаГруппаПодсказкаАссистентаПервичныйЗапускПустая;
	Иначе
		Элементы.СтраницыГруппаПодсказкаАссистентаПервичныйЗапуск.ТекущаяСтраница = Элементы.СтраницаГруппаПодсказкаАссистентаПервичныйЗапуск;
	КонецЕсли;
	
	//@skip-check new-font
	ТекстПоследнегоЗапуска = Новый ФорматированнаяСтрока(СтрокаВремени, Новый Шрифт("Arial", 10, Истина));
	ТекстПоследнегоЗапуска = Новый ФорматированнаяСтрока("Последний запуск задания обмена: ", ТекстПоследнегоЗапуска);
	
	//@skip-check new-font
	ТекстСледующегоЗапуска = Новый ФорматированнаяСтрока(СтрокаВремени2, Новый Шрифт("Arial", 10, Истина));
	ТекстСледующегоЗапуска = Новый ФорматированнаяСтрока("Ожидаемый следующий запуск: ", ТекстСледующегоЗапуска);
	
	Элементы.ДекорацияДатаПоследнегоЗапуска.Заголовок = ТекстПоследнегоЗапуска;
	Элементы.ДекорацияДатаСледующегоЗапуска.Заголовок = ТекстСледующегоЗапуска;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНастройкуНаНаСервере(ИмяСтраницы, Статус = 0)
	
	МассивСтрок = Объект.СостояниеНастроек.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяСтраницы));
	
	Если МассивСтрок.количество() Тогда
		ТекНастройка = МассивСтрок[0];
	Иначе
		ТекНастройка = Объект.СостояниеНастроек.Добавить();
	КонецЕсли;
	
	ТекНастройка.ИмяСтраницы = ИмяСтраницы;
	ТекНастройка.Статус = Статус;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНастройкуНаКлиенте(ИмяСтраницы, Статус = 0)
	
	МассивСтрок = Объект.СостояниеНастроек.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяСтраницы));
	
	Если МассивСтрок.Количество() Тогда
		ТекНастройка = МассивСтрок[0];
	Иначе
		ТекНастройка = Объект.СостояниеНастроек.Добавить();
	КонецЕсли;
	
	ТекНастройка.ИмяСтраницы = ИмяСтраницы;
	ТекНастройка.Статус = Статус;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормыИзБезопасногоХранилища()
	
	АвторизацияВКонтактеПараметры = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.АвторизацияВКонтактеПараметрыНовый( Объект.СпособАвторизации );
	ИнтеграцияСМагазинамиСоцСетейСервер.АвторизацияВКонтактеПараметрыИзБезопасногоХранилищеПолучить( Объект.Ссылка, АвторизацияВКонтактеПараметры );
	
	АвторизацияВКонтактеПараметры.УчетнаяЗапись = Объект.Ссылка;
	
	ДанныеАвторизацииСообществаЗаполнены = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.ДанныеАвторизацииСообществаЗаполнены( АвторизацияВКонтактеПараметры );
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере() 

	ОбновитьДанныеФормыИзБезопасногоХранилища();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.ДатаОперации КАК ДатаОперации,
		|	ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.ТребуетсяРучноеПодтверждение КАК ТребуетсяРучноеПодтверждение,
		|	ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.ПодтверждениеОперацииСтрокой КАК ПодтверждениеОперацииСтрокой
		|ИЗ
		|	РегистрСведений.ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей КАК ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей
		|ГДЕ
		|	ПоследняяУспешнаяОперацияОбменаДляМагазинаСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТребуетсяРучноеПодтверждение = Ложь;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ТребуетсяРучноеПодтверждение = ВыборкаДетальныеЗаписи.ТребуетсяРучноеПодтверждение;
		ПодтверждениеОперацииСтрокой = ВыборкаДетальныеЗаписи.ПодтверждениеОперацииСтрокой;
		
		Если ТребуетсяРучноеПодтверждение Тогда
			СоответствиеОтвет = ИнтеграцияСМагазинамиСоцСетейСервер.ПолучитьСоответствиеИзJSON(ПодтверждениеОперацииСтрокой);
			Если ТипЗнч(СоответствиеОтвет) = Тип("Соответствие") Тогда
				СтрокаURL = ИнтеграцияСМагазинамиСоцСетейСервер.ПолучитьЗначениеСоответствия(СоответствиеОтвет, "error.captcha_img");
				Если НЕ ЗначениеЗаполнено(СтрокаURL) Тогда
					ТребуетсяРучноеПодтверждение = Ложь;
				КонецЕсли;
			Иначе
				ТребуетсяРучноеПодтверждение = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ВерсияAPI = ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьАктуальнуюВерсиюAPI();
	ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьВидыЗаказовПокупателей = ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей");
	УчетПоНесколькимПодразделениям = ПолучитьФункциональнуюОпцию("УчетПоНесколькимПодразделениям");
	УчетВалютныхОпераций = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	ИспользоватьГруппыДоступаКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаКонтрагентов");
	
	ОбновитьОтображениеСтрокиСопоставления();
	
	Если ЗначениеЗаполнено(АвторизацияВКонтактеПараметры.access_token) Тогда
		ОбновитьСписокГруппНаСервере();
	КонецЕсли;
	
	СписокСкладов.ЗагрузитьЗначения(Объект.СтруктурныеЕдиницы.Выгрузить(,"СтруктурнаяЕдиница").ВыгрузитьКолонку("СтруктурнаяЕдиница"));
	
	ОбновитьОтображениеСтрокиПроверки();
	ОбновитьОтображениеВремениЗапуска();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСтрокиПроверки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеПоляФайловДляМагазинаСоцСетей.Файл КАК Файл
	|ИЗ
	|	РегистрСведений.ДополнительныеПоляФайловДляМагазинаСоцСетей КАК ДополнительныеПоляФайловДляМагазинаСоцСетей
	|ГДЕ
	|	(ДополнительныеПоляФайловДляМагазинаСоцСетей.Высота < 400
	|			ИЛИ ДополнительныеПоляФайловДляМагазинаСоцСетей.Ширина < 400)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Элементы.СтрокаПроверки.Видимость = НЕ РезультатЗапроса.Пустой();
	Элементы.СтрокаПроверкиИнтеграция.Видимость = НЕ РезультатЗапроса.Пустой();
	
	СтрокаПроверки = "Изображения не прошедшие проверку";
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСтрокиСопоставления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(НоменклатураХарактеристикДляМагазинаСоцСетей.Номенклатура), 0) КАК КоличествоЭлементов
	|ИЗ
	|	РегистрСведений.НоменклатураХарактеристикДляМагазинаСоцСетей КАК НоменклатураХарактеристикДляМагазинаСоцСетей
	|ГДЕ
	|	НоменклатураХарактеристикДляМагазинаСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	КоличествоКатегорий = ВыборкаДетальныеЗаписи.КоличествоЭлементов;
	
	Если КоличествоКатегорий = 0 Тогда
		СтрокаСопоставления = "<Требуется ВЫБРАТЬ номенклатуру к обмену с ВКонтакте>";
		Элементы.СтрокаСопоставления.ЦветТекста = WebЦвета.Красный;
	Иначе
		СтрШаблонСопоставления = "Управление товарами выбранными к обмену с ВКонтакте (%1)";
		СтрокаСопоставления = СтрШаблон(СтрШаблонСопоставления, КоличествоКатегорий);
		Элементы.СтрокаСопоставления.ЦветТекста = Новый Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаСопоставленияНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьОтображениеСтрокиСопоставления();
	
	Если Результат = Истина Тогда
		
		ОткрытьФорму("Справочник.Номенклатура.ФормаСписка",,ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ФормаВыбораНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьОтображениеСтрокиСопоставления();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовыйКодНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект", Тип("ПланОбменаОбъект.ИнтеграцияСМагазинамиСоцСетей"));
	ТекОбъект.УстановитьНовыйКод();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеНаСервере()
	
	Если Объект.НастройкаЗавершена Тогда
		Для Каждого Стр Из Объект.СостояниеНастроек Цикл
			Элементы["СтраницыЭтапыНастройки" + Стр.ИмяСтраницы].ТекущаяСтраница = Элементы["Страница" + Стр.ИмяСтраницы + "2"];
			Элементы["ГруппаНижнееМеню" + Стр.ИмяСтраницы].Видимость = Ложь;
		КонецЦикла;
		
		Элементы.ГруппаПоздравление.Видимость = Ложь;
		Элементы.СтраницыВариантаПоздравления.Видимость = Ложь;
		Элементы.ЗагрузкаТоваровПункт.Доступность = Истина;
		
		Элементы.ГруппаКоманднаяПанель.Видимость = Истина;
		Элементы.КнопкаЗаписатьИЗакрыть.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ДобавитьНастройкуНаНаСервере("Приветствие",1);
		ДобавитьНастройкуНаНаСервере("Дополнительно");
		ДобавитьНастройкуНаНаСервере("Чат");
		ДобавитьНастройкуНаНаСервере("Товары");
		ДобавитьНастройкуНаНаСервере("Заказы");
		ДобавитьНастройкуНаНаСервере("СтатусыЗаказа");
		ДобавитьНастройкуНаНаСервере("Доставка");
		ДобавитьНастройкуНаНаСервере("Оповещения");
		ДобавитьНастройкуНаНаСервере("Обслуживание");
		
		Элементы.ОбновитьТокенДоступа.Заголовок = НСтр("ru = 'Авторизоваться'");
		Элементы.ОбновитьТокенДоступаСообщества.Заголовок = НСтр("ru = 'Авторизоваться'");
		
		Элементы.СтраницыПодсказкаАссистентаДополнительно.ТекущаяСтраница
		= Элементы.СтраницаПодсказкаАссистентаДополнительноАвторизация;
		
		Элементы.ГруппаКоманднаяПанель.Видимость = Ложь;
		
	Иначе
		
		Элементы.ОбновитьТокенДоступа.Заголовок = НСтр("ru = 'Обновить токен'");
		Элементы.ОбновитьТокенДоступаСообщества.Заголовок = НСтр("ru = 'Обновить токен'");
		
		Элементы.СтраницыПодсказкаАссистентаДополнительно.ТекущаяСтраница
		= Элементы.СтраницаПодсказкаАссистентаДополнительноОбновить;
		
		Элементы.ИдентификаторГруппы.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПризнакПоПунктуНаКлиенте(ИмяПункта)
	
	Для Каждого Стр Из Объект.СостояниеНастроек Цикл
	
		Если Стр.Статус = 2 Тогда
			СтатусДляОтображения = "0";
		Иначе
			СтатусДляОтображения = Стр.Статус;
		КонецЕсли;	
	
		Элементы["СтраницыЭтапыНастройки" + Стр.ИмяСтраницы].ТекущаяСтраница = Элементы["Страница" + Стр.ИмяСтраницы + СтатусДляОтображения];
		Элементы["" + Стр.ИмяСтраницы + "Надпись"].Шрифт = Новый Шрифт();
	КонецЦикла;
	
	Элементы["СтраницыЭтапыНастройки" + ИмяПункта].ТекущаяСтраница = Элементы["Страница" + ИмяПункта + "1"];
	
	//@skip-check new-font
	Элементы["" + ИмяПункта + "Надпись"].Шрифт = Новый Шрифт("Arial",8,Истина);
	
	Элементы.СтраницыПунктыМеню.ТекущаяСтраница = Элементы["Страница" + ИмяПункта];
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеНаКлиенте()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		
		ЕстьПереходПоСтранице = Ложь;
		Для Каждого Стр Из Объект.СостояниеНастроек Цикл
			
			Элементы["СтраницыЭтапыНастройки" + Стр.ИмяСтраницы].ТекущаяСтраница = Элементы["Страница" + Стр.ИмяСтраницы + Стр.Статус];
			
			Если Стр.Статус = 1 Тогда
				ЕстьПереходПоСтранице = Истина;
				Элементы.СтраницыПунктыМеню.ТекущаяСтраница = Элементы["Страница" + Стр.ИмяСтраницы];
				//@skip-check new-font
				Элементы["" + Стр.ИмяСтраницы + "Надпись"].Шрифт = Новый Шрифт("Arial",8,Истина);
			Иначе
				Элементы["" + Стр.ИмяСтраницы + "Надпись"].Шрифт = Новый Шрифт;
			КонецЕсли;
			
			Элементы["" + Стр.ИмяСтраницы + "Пункт"].Доступность = (Стр.Статус <> 0);
			
		КонецЦикла;
		
		Если Не ЕстьПереходПоСтранице Тогда
			Объект.НастройкаЗавершена = Истина;
			Записать();
			ОбновитьОтображениеНаСервере();
			Элементы.ГруппаПоздравление.Видимость = Истина;
			Элементы.СтраницыВариантаПоздравления.Видимость = Истина;
			Элементы.СтраницыВариантаПоздравления.ТекущаяСтраница = Элементы.СтраницаПоздравлениеПочтиВсе;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СписокСкладов.Видимость = Объект.ВыгружатьОстаток;
	Элементы.ВариантВыгрузкиХарактеристик.Видимость = ИспользоватьХарактеристики;
	
	Элементы.Организация.Видимость = ИспользоватьНесколькоОрганизаций;
	Элементы.ДобавлятьФайлыХарактеристикиИзНоменклатуры.Видимость = ИспользоватьХарактеристики;
	Элементы.ВидЗаказа.Видимость = ИспользоватьВидыЗаказовПокупателей;
	Элементы.ПодразделениеДляПодстановкиВЗаказы.Видимость = УчетПоНесколькимПодразделениям;
	Элементы.ВалютаДляПодстановкиВЗаказы.Видимость = УчетВалютныхОпераций;
	Элементы.ГруппаДоступаДляНовыхКонтрагентов.Видимость = ИспользоватьГруппыДоступаКонтрагентов;
	Элементы.ГруппаСтатусыЗаказов.Видимость = Объект.ОбмениватьсяСтатусамиЗаказа;
	Элементы.ГруппаСлужбыДоставки.Видимость = Объект.ИспользоватьДоставку;
	Элементы.ОткрытьПодборкуТоваров.Видимость = Объект.ИспользоватьПодборкиТоваров;
	Элементы.ГруппаОповещения.Видимость = Объект.ИспользоватьОповещения;
	Элементы.ГруппаВидыЦен.Видимость = Объект.ВыгружатьЦены;
	
	ВкладкаЧатОбновить();
	
	Элементы.СпособУстановкиДатыОтгрузкиЗаказаКоличествоДней.Видимость = Объект.СпособУстановкиДатыОтгрузкиЗаказа
	<> ПредопределенноеЗначение("Перечисление.СпособыУстановкиДатыДляМагазинаСоцСетей.ПустаяСсылка");
	
	ПодключитьОбработчикОжидания("ПроверитьОткрытьФормуПодтверждения", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОткрытьФормуПодтверждения() Экспорт
	
	Если ТребуетсяРучноеПодтверждение Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СтрокаURL", СтрокаURL);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьОтображениеНаКлиентеЗавершение", ЭтотОбъект);
		
		ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаПодтверждения", ПараметрыФормы, ЭтотОбъект
		,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ПроверитьОткрытьФормуПодтверждения");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТоварыВКонтактеНаКлиенте()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СтрокаСопоставленияНажатиеЗавершение", ЭтотОбъект);
	
	ОписаниеУзлаОбменаВК = Новый Структура;
	ОписаниеУзлаОбменаВК.Вставить("ТокенДоступа" , АвторизацияВКонтактеПараметры.access_token);
	ОписаниеУзлаОбменаВК.Вставить("ИдентификаторГруппы" , Объект.ИдентификаторГруппы);
	ОписаниеУзлаОбменаВК.Вставить("МагазинДляИнтеграции" , Объект.МагазинДляИнтеграции);
	ОписаниеУзлаОбменаВК.Вставить("СсылкаНаУзелОбмена" , Объект.Ссылка);
	ОписаниеУзлаОбменаВК.Вставить("ПоказатьНоменклатуру" , Истина);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаСопоставления", ОписаниеУзлаОбменаВК, 
	ЭтотОбъект,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОперациюВФоне(ПолныйОбмен = Ложь)
	
	Если Модифицированность = Истина Тогда
		Записать();
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапуститьОперациюВФонеЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТребуетсяРучноеПодтверждение" , ТребуетсяРучноеПодтверждение);
	ПараметрыФормы.Вставить("СтрокаЗначениеСКартинки" , СтрокаЗначениеСКартинки);
	ПараметрыФормы.Вставить("ПолныйОбмен" , ПолныйОбмен);
	ПараметрыФормы.Вставить("СсылкаНаУзелОбмена" , Объект.Ссылка);
	
	ОткрытьФорму("ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.ФормаОжидания",ПараметрыФормы,
	ЭтотОбъект,УникальныйИдентификатор,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуТовары()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Товары");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуОбслуживание()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Обслуживание");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуЗаказы()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Заказы");
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьСтраницуСтатусыЗаказа()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("СтатусыЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуДоставка()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Доставка");
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьСтраницуИнтеграции()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Интеграции");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуДополнительно() 
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Дополнительно");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуЧат()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Чат");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуПриветствие()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Приветствие");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуОповещение()
	
	Если НЕ Объект.НастройкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПризнакПоПунктуНаКлиенте("Оповещения");
КонецПроцедуры

&НаКлиенте
Процедура ОбсужденияПодключеныЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	Если Объект.ПодключитьВходящиеСообщения Тогда
		СоздатьИнтеграциюЧатаНаСервере();
	КонецЕсли;
	
	Записать();
	
	ДобавитьНастройкуНаКлиенте("Приветствие",2);
	ДобавитьНастройкуНаКлиенте("Дополнительно",2);
	ДобавитьНастройкуНаКлиенте("Чат",2);
	ДобавитьНастройкуНаКлиенте("Товары",1);
	
	ОбновитьОтображениеНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьИнтеграциюЧатаНаСервере(ПрефиксПроверки = "")
	
	Если ОбсужденияПодключены() Тогда
		
		ПараметрыИнтеграции = Новый Структура;
		ПараметрыИнтеграции.Вставить("Идентификатор", Неопределено);
		ПараметрыИнтеграции.Вставить("Ключ", СтрШаблон("VK (%1) %2", Объект.НаименованиеГруппы, ПрефиксПроверки));
		ПараметрыИнтеграции.Вставить("Тип", ОбсужденияСлужебныйКлиентСервер.ТипыВнешнихСистем().ВКонтакте);
		ПараметрыИнтеграции.Вставить("token", АвторизацияВКонтактеПараметры.access_token_community);
		ПараметрыИнтеграции.Вставить("groupId", Объект.ИдентификаторГруппы);
		
		Участники = Новый Массив(1);
		Участники[0] = Пользователи.ТекущийПользователь();
		ПараметрыИнтеграции.Вставить("Участники", Участники);
		
		Попытка
			ОбсужденияСлужебный.СоздатьИзменитьИнтеграцию(ПараметрыИнтеграции);
		Исключение
			
			ОшибкаТекст = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписьЖурналаРегистрации(ОбсужденияСлужебный.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОшибкаТекст);
			
			СообщениеШаблон = НСтр( "ru = 'В процессе подключения чата произошла ошибка. Подключите чат в ручную. Ошибка: %1'" );
			СообщениеТекст = СтрШаблон( СообщениеШаблон, ОшибкаТекст);
			ОбщегоНазначения.СообщитьПользователю( СообщениеТекст );
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбсужденияПодключены()
	
	Возврат Обсуждения.ОбсужденияДоступны();
	
КонецФункции

&НаСервереБезКонтекста
Функция УчетнаяЗаписьНастроена(УчетнаяЗаписьДляОповещения)
	Возврат РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗаписьДляОповещения, Истина, Неопределено);
КонецФункции

&НаКлиенте
Процедура ОткрытьИнструкцию()
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://its.1c.ru/db/metod81#content:7804:hdoc");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИнтеграциюНаСервере()
	
	Объект.ПометкаУдаления = Истина;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИнтеграцию()
	Оповещение = Новый ОписаниеОповещения("УдалитьИнтеграциюЗавершение", ЭтотОбъект, Параметры);
	
	ТекстВопросаШаблон = 
	НСтр("ru = 'Будут удалены все настройки текущей интеграции с сообществом ""%1"".
          |Заказы с сайта перестанут загружаться в 1С.
          |
          |Продолжить?'");
	ТекстВопроса = СтрШаблон( ТекстВопросаШаблон, Объект.НаименованиеГруппы );
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
КонецПроцедуры

&НаКлиенте
Процедура ФормаОпубликоватьПослеВыбораПодменю(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "УдалитьИнтеграцию" Тогда
		НачатьУдалениеИнтеграции();
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ЗарегистрироватьВсеДанныеКОбмену" Тогда
		//@skip-check invocation-form-event-handler
		ЗарегистрироватьВсеДанныеКОбменуНаКлиенте();
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ЗарегистрироватьЦенуИКоличествоКОбмену" Тогда
		//@skip-check invocation-form-event-handler
		ЗарегистрироватьЦенуИКоличествоКОбменуНаКлиенте();
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ОткрытьПоследнююУспешнуюЗапись" Тогда
		ОткрытьПоследнююУспешнуюЗапись();
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "УдалениеТоваровВК" Тогда
		УдалениеТоваровВК();
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "УдалитьЗарегистрированныеИзменения" Тогда
		УдалитьЗарегистрированныеИзменения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУдалениеИнтеграции()
	
	Оповещение = Новый ОписаниеОповещения("УдалитьИнтеграциюЗавершение", ЭтотОбъект, Параметры);
	ТекстВопроса = НСтр("ru = 'После удаления, будет потеряна связь с сообществом ВКонтакте.
	|
	|Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИнтеграциюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьИнтеграциюНаСервере();
	Оповестить("ОбновитьСписокИнтеграцияСМагазинамиСоцСетей");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗарегистрированныеИзменения()
	
	УдалитьЗарегистрированныеИзмененияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗарегистрированныеИзмененияНаСервере()
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеРегламентногоЗадания()
	
	РасписаниеРегламентногоЗадания = Неопределено;
	
	Если Объект.РасписаниеРегламентногоЗадания <> "" Тогда
		Попытка
			РасписаниеРегламентногоЗадания = ЗначениеИзСтрокиВнутр(Объект.РасписаниеРегламентногоЗадания);
		Исключение
			РасписаниеРегламентногоЗадания = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Если ТипЗнч(РасписаниеРегламентногоЗадания) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		РасписаниеРегламентногоЗадания =
		ИнтеграцияСМагазинамиСоцСетейСервер.ПолучитьРасписаниеРегламентногоЗаданияПоУмолчанию();
	КонецЕсли;
	
	Возврат РасписаниеРегламентногоЗадания;
	
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;

	АвторизацияВКонтактеПараметры.УчетнаяЗапись = ТекущийОбъект.Ссылка;
	
	Если Не ТекущийОбъект.ПометкаУдаления Тогда
	
		УчетнаяЗапись = ТекущийОбъект.Ссылка;
		ИнтеграцияСМагазинамиСоцСетейСервер.АвторизацияВКонтактеПараметрыВБезопасноеХранилищеЗаписать( УчетнаяЗапись, АвторизацияВКонтактеПараметры );
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаАвторизацииВКонтактеОткрыть( АвторизацияСообщества = Ложь )

	Если Не ЗначениеЗаполнено( Объект.КодПриложения ) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю( НСтр( "ru = 'Идентификатор приложения ВКонтакте не заполнен.'" ) );
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить( "КодПриложения", Объект.КодПриложения );
	ПараметрыФормы.Вставить( "ИдентификаторГруппы", Объект.ИдентификаторГруппы );
	ПараметрыФормы.Вставить( "АвторизацияВКонтактеПараметры", АвторизацияВКонтактеПараметры );
	ПараметрыФормы.Вставить( "МагазинДляИнтеграции", Объект.МагазинДляИнтеграции );
	ПараметрыФормы.Вставить( "СпособАвторизации", Объект.СпособАвторизации );
	ПараметрыФормы.Вставить( "АвторизацияСообщества", АвторизацияСообщества );
	ПараметрыФормы.Вставить( "УчетнаяЗапись", Объект.Ссылка );
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения( "ФормаАвторизацииВКонтактеПослеЗакрытия", ЭтотОбъект );
	ОткрытьФорму( "ПланОбмена.ИнтеграцияСМагазинамиСоцСетей.Форма.АвторизацияПриложенияВКонтакте", 
	ПараметрыФормы, ЭтотОбъект, ,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца );
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаАвторизацииВКонтактеПослеЗакрытия( РезультатЗакрытия, ДополнительныеПараметры ) Экспорт
	
	Если ТипЗнч( РезультатЗакрытия ) = Тип( "Структура" ) Тогда

		Модифицированность = Истина;

		ОшибкаАвторизации = Ложь;
		ОбновитьНаФормеПризнакОшибкиАвторизации();
		
		Объект.СпособАвторизации = РезультатЗакрытия.СпособАвторизации;
		
		АвторизацияСообществаСвойстваИмена = "access_token_community, ОкончанияДействияТокенДоступаСообщества";
		Если РезультатЗакрытия.АвторизацияСообщества Тогда
		
			ЗаполнитьЗначенияСвойств( АвторизацияВКонтактеПараметры, 
			РезультатЗакрытия.АвторизацияВКонтактеПараметры,
			АвторизацияСообществаСвойстваИмена );
			
			ДанныеАвторизацииСообществаЗаполнены = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.ДанныеАвторизацииСообществаЗаполнены( АвторизацияВКонтактеПараметры );
			
		Иначе

			Объект.ИдентификаторПользователя = РезультатЗакрытия.ИдентификаторПользователя;
			
			ЗаполнитьЗначенияСвойств( АвторизацияВКонтактеПараметры, 
			РезультатЗакрытия.АвторизацияВКонтактеПараметры,
			,
			АвторизацияСообществаСвойстваИмена );
			
			ОбновитьСписокГруппНаСервере( Истина );
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВкладкаЧатОбновить()
	Элементы.ОбновитьТокенДоступаСообщества.Доступность = Объект.ПодключитьВходящиеСообщения;
КонецПроцедуры

#КонецОбласти
